; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l9_p9_c9_g9_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(crate-content crate5 medicine)
	(crate-content crate6 medicine)
	(crate-content crate7 medicine)
	(crate-content crate8 medicine)
	(crate-content crate9 medicine)
	(at person1 loc1)
	(at person2 loc9)
	(at person3 loc9)
	(at person4 loc3)
	(at person5 loc9)
	(at person6 loc3)
	(at person7 loc8)
	(at person8 loc9)
	(at person9 loc1)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 food)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person8 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 food)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person8 medicine)
	))
)

; plan
1. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 1 of 10
2. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 1 of 10
3. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 0 of 10
4. (deliver-arm1 drone1 person4 crate9 medicine loc3)
   deleted: (arm1-load drone1 crate9) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 1 of 10
5. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 2 of 10
6. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 2 of 10
7. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 1 of 10
8. (deliver-arm2 drone1 person6 crate2 food loc3)
   deleted: (arm2-load drone1 crate2) (person-needs person6 food)
   added: (arm2-free drone1) (person-has person6 food)
   goals met: 2 of 10
9. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 3 of 10
10. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 3 of 10
11. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 2 of 10
12. (deliver-arm2 drone1 person7 crate1 food loc8)
   deleted: (arm2-load drone1 crate1) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 3 of 10
13. (deliver-arm1 drone1 person7 crate8 medicine loc8)
   deleted: (arm1-load drone1 crate8) (person-needs person7 medicine)
   added: (arm1-free drone1) (person-has person7 medicine)
   goals met: 4 of 10
14. (move-drone drone1 loc8 loc3)
   deleted: (at drone1 loc8)
   added: (at drone1 loc3)
   goals met: 4 of 10
15. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 5 of 10
16. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 5 of 10
17. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 4 of 10
18. (deliver-arm2 drone1 person6 crate7 medicine loc3)
   deleted: (arm2-load drone1 crate7) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 5 of 10
19. (move-drone drone1 loc3 loc9)
   deleted: (at drone1 loc3)
   added: (at drone1 loc9)
   goals met: 5 of 10
20. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 6 of 10
21. (grab-arm2 drone1 crate6 depot)
   deleted: (arm2-free drone1) (at crate6 depot)
   added: (arm2-load drone1 crate6)
   goals met: 6 of 10
22. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 5 of 10
23. (deliver-arm2 drone1 person2 crate6 medicine loc9)
   deleted: (arm2-load drone1 crate6) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 6 of 10
24. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 7 of 10
25. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 7 of 10
26. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 6 of 10
27. (deliver-arm2 drone1 person3 crate5 medicine loc9)
   deleted: (arm2-load drone1 crate5) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 7 of 10
28. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 8 of 10
29. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 8 of 10
30. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 7 of 10
31. (deliver-arm2 drone1 person5 crate4 medicine loc9)
   deleted: (arm2-load drone1 crate4) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 8 of 10
32. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 9 of 10
33. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 9 of 10
34. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 8 of 10
35. (deliver-arm2 drone1 person8 crate3 medicine loc9)
   deleted: (arm2-load drone1 crate3) (person-needs person8 medicine)
   added: (arm2-free drone1) (person-has person8 medicine)
   goals met: 9 of 10
36. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 10 of 10
